package com.dongfeng.study.basicstudy.windows;

/**
 * Windows10 环境变量（environment variables）
 *
 * @author eastFeng
 * @date 2022-11-27 23:42
 */
public class EnvironmentVariables {

    /*
     *
     * 环境变量（environment variables）一般是指在操作系统中用来指定操作系统运行环境的一些参数，
     * 如：临时文件夹位置和系统文件夹位置等。
     * 环境变量是在操作系统中一个具有特定名字的对象，它包含了一个或者多个应用程序所将使用到的信息。
     *
     * 1、Windows 环境变量
     * Windows系统中，如果我们安装了某个软件，安装目录会有可以执行的exe文件，
     * 但如果我们没有配置环境变量，在命令窗口中不能直接运行exe文件，需要指exe文件的完整路径。
     * 如果我们配置了环境变量，则就可以直接运行exe程序。
     * 通过在环境变量里面加入所有软件的安装路径，当需要运行某一软件时双击其快捷方式或者在DOS界面输入软件名称，
     * 计算机除了在其当前目录下寻找该软件的.exe文件外，还在环境变量中搜索软件的路径查找。
     * 主要作用就是没有指定程序的完整路径，则可以通过环境变量更方便的查找运行。
     * 环境变量有些情况下也用作应用程序添加额外的配置信息的一种方式。
     *
     * 2、Windows 用户变量和系统变量
     * 点击 “我的电脑→属性→高级系统设置” 标签的 “环境变量” 按钮，出现 “环境变量” 对话框。
     * Path变量的值是用户变量中的值与系统变量中的值的叠加。
     * 系统环境变量，对所有用户起作用,而用户环境变量只对当前用户起作用。
     *
     * 1）用户变量
     * 由操作系统、某些应用程序以及用户建立，例如，应该安装程序将临时文件夹设定了默认存储位置，并视为用户变量。
     * 任何用户都可以添加、修改或删除。
     *
     * 2）系统变量
     * 与Windows操作系统包括网络状况有关，由操作系统定义。Administrators组的用户可以添加添加、修改或删除。
     *
     *
     */

}
